{
  "Механика": {
    "Кинематика": {
      "1.1.1 Механическое движение и его виды": {
        "описание": "Механическое движение — это изменение положения тела относительно других тел в пространстве и времени.",
        "формулы": []
      },
      "1.1.2 Относительность механического движения": {
        "описание": "Движение является относительным, то есть зависит от системы отсчета.",
        "формулы": [
          {"формула": "x' = x - vt", "описание": "Преобразование координат в системе отсчета, движущейся с постоянной скоростью v относительно первоначальной системы."}
        ]
      },
      "1.1.3 Скорость": {
        "описание": "Скорость — это физическая величина, показывающая быстроту изменения положения тела.",
        "формулы": [
          {"формула": "v = Δx / Δt", "описание": "Средняя скорость тела, где Δx — изменение положения, Δt — время."}
        ]
      },
      "1.1.4 Ускорение": {
        "описание": "Ускорение — это величина, показывающая, как изменяется скорость тела за единицу времени.",
        "формулы": [
          {"формула": "a = Δv / Δt", "описание": "Среднее ускорение, где Δv — изменение скорости, Δt — время."}
        ]
      },
      "1.1.5 Равномерное движение": {
        "описание": "Равномерное движение — это движение, при котором тело перемещается с постоянной скоростью.",
        "формулы": [
          {"формула": "x = x0 + vt", "описание": "Уравнение прямолинейного равномерного движения, где x0 — начальная координата, v — скорость, t — время."}
        ]
      },
      "1.1.6 Прямолинейное равноускоренное движение": {
        "описание": "Движение, при котором тело движется по прямой с постоянным ускорением.",
        "формулы": [
          {"формула": "v = v0 + at", "описание": "Скорость тела в любой момент времени при равноускоренном движении, где v0 — начальная скорость, a — ускорение, t — время."},
          {"формула": "x = x0 + v0t + 0.5at^2", "описание": "Перемещение тела при равноускоренном движении, где x0 — начальная координата."}
        ]
      },
      "1.1.7 Свободное падение (ускорение свободного падения)": {
        "описание": "Свободное падение — это движение тела, находящегося под воздействием силы тяжести.",
        "формулы": [
          {"формула": "v = g * t", "описание": "Скорость тела при свободном падении, где g — ускорение свободного падения, t — время падения."}
        ]
      },
      "1.1.8 Движение по окружности с постоянной по модулю скоростью. Центростремительное ускорение": {
        "описание": "Движение тела по окружности с постоянной по модулю скоростью, при котором возникает центростремительное ускорение.",
        "формулы": [
          {"формула": "a_c = v^2 / r", "описание": "Центростремительное ускорение, где v — скорость тела, r — радиус окружности."}
        ]
      }
    },
    "Динамика": {
      "1.2.1 Инерциальные системы отсчета. Первый закон Ньютона": {
        "описание": "Инерциальные системы отсчета — это такие системы, в которых тело сохраняет свое состояние покоя или прямолинейного равномерного движения, если на него не действуют внешние силы.",
        "формулы": [
          {"формула": "F = 0", "описание": "Первый закон Ньютона: если на тело не действуют силы, то его скорость постоянна."}
        ]
      },
      "1.2.2 Принцип относительности Галилея": {
        "описание": "Принцип относительности утверждает, что законы физики одинаковы во всех инерциальных системах отсчета.",
        "формулы": []
      },
      "1.2.3 Масса тела": {
        "описание": "Масса тела — это мера его инертности и гравитационного взаимодействия.",
        "формулы": []
      },
      "1.2.4 Плотность вещества": {
        "описание": "Плотность — это физическая величина, равная массе вещества, деленной на его объем.",
        "формулы": [
          {"формула": "ρ = m / V", "описание": "Плотность вещества, где ρ — плотность, m — масса, V — объем."}
        ]
      },
      "1.2.5 Сила": {
        "описание": "Сила — это векторная величина, характеризующая воздействие одного тела на другое.",
        "формулы": []
      },
      "1.2.6 Принцип суперпозиции сил": {
        "описание": "Если на тело действует несколько сил, то их результирующая сила равна векторной сумме этих сил.",
        "формулы": [
          {"формула": "F_res = F1 + F2 + ... + Fn", "описание": "Результирующая сила, равная сумме всех действующих на тело сил."}
        ]
      },
      "1.2.7 Второй закон Ньютона": {
        "описание": "Второй закон Ньютона устанавливает зависимость между силой, массой тела и ускорением.",
        "формулы": [
          {"формула": "F = ma", "описание": "Второй закон Ньютона: сила равна массе тела, умноженной на его ускорение."}
        ]
      },
      "1.2.8 Третий закон Ньютона": {
        "описание": "Третий закон Ньютона: силы, с которыми два тела действуют друг на друга, равны по величине и противоположны по направлению.",
        "формулы": [
          {"формула": "F12 = -F21", "описание": "Третий закон Ньютона: сила, с которой тело 1 действует на тело 2, равна по величине и противоположна по направлению силе, с которой тело 2 действует на тело 1."}
        ]
      },
      "1.2.9 Закон всемирного тяготения": {
        "описание": "Закон всемирного тяготения описывает притяжение между двумя телами, массами которых m1 и m2, на расстоянии r.",
        "формулы": [
          {"формула": "F = G * (m1 * m2) / r^2", "описание": "Закон всемирного тяготения, где F — сила взаимодействия, G — гравитационная постоянная, m1 и m2 — массы тел, r — расстояние между их центрами."}
        ]
      },
      "1.2.10 Сила тяжести": {
        "описание": "Сила тяжести — это сила притяжения, с которой Земля действует на тела.",
        "формулы": [
          {"формула": "F = mg", "описание": "Сила тяжести, где m — масса тела, g — ускорение свободного падения."}
        ]
      },
      "1.2.11 Вес и невесомость": {
        "описание": "Вес тела — это сила, с которой тело действует на опору или подвес, равная силе тяжести, действующей на него.",
        "формулы": [
          {"формула": "W = mg", "описание": "Вес тела, где W — вес, m — масса тела, g — ускорение свободного падения."}
        ]
      },
      "1.2.12 Сила упругости. Закон Гука": {
        "описание": "Сила упругости пропорциональна деформации тела в пределах упругости.",
        "формулы": [
          {"формула": "F = -k * x", "описание": "Закон Гука, где F — сила упругости, k — коэффициент жесткости, x — величина деформации."}
        ]
      },
      "1.2.13 Сила трения": {
        "описание": "Сила трения — это сила, возникающая при взаимодействии двух тел, препятствующая их относительному движению.",
        "формулы": [
          {"формула": "F_tr = μ * N", "описание": "Сила трения, где μ — коэффициент трения, N — нормальная сила."}
        ]
      },
      "1.2.14 Давление": {
        "описание": "Давление — это сила, действующая на единицу площади поверхности.",
        "формулы": [
          {"формула": "p = F / S", "описание": "Давление, где p — давление, F — сила, S — площадь."}
        ]
      }
    },
    "Статика": {
      "1.3.1 Момент силы": {
        "описание": "Момент силы относительно точки — это величина, характеризующаяся силой и расстоянием от точки приложения силы до оси вращения.",
        "формулы": [
          {"формула": "M = F * r * sin(θ)", "описание": "Момент силы, где M — момент силы, F — сила, r — расстояние от оси вращения, θ — угол между вектором силы и вектором радиус-вектора."}
        ]
      },
      "1.3.2 Условия равновесия твердого тела": {
        "описание": "Твердое тело находится в равновесии, если сумма всех сил и сумма всех моментов сил относительно произвольной точки равны нулю.",
        "формулы": [
          {"формула": "ΣF = 0", "описание": "Условие равновесия: сумма всех сил должна быть равна нулю."},
          {"формула": "ΣM = 0", "описание": "Условие равновесия: сумма всех моментов сил относительно произвольной точки должна быть равна нулю."}
        ]
      },
      "1.3.3 Давление жидкости": {
        "описание": "Давление в жидкости зависит от высоты столба жидкости и плотности вещества. Давление передается без изменения в любую точку жидкости.",
        "формулы": [
          {"формула": "p = ρgh", "описание": "Давление на глубине h, где p — давление, ρ — плотность жидкости, g — ускорение свободного падения, h — глубина."}
        ]
      },
      "1.3.4 Закон Паскаля": {
        "описание": "Закон Паскаля утверждает, что давление, создаваемое в замкнутом сосуде, передается одинаково во всех направлениях.",
        "формулы": [
          {"формула": "p1 = p2", "описание": "Давление в замкнутом сосуде одинаково в любых точках, если сосуд полностью герметичен."}
        ]
      },
      "1.3.5 Закон Архимеда": {
        "описание": "Сила Архимеда — это сила, с которой жидкость или газ действует на тело, погруженное в него, и эта сила равна весу выталкиваемой телом жидкости или газа.",
        "формулы": [
          {"формула": "F_A = ρ * V * g", "описание": "Сила Архимеда, где F_A — сила Архимеда, ρ — плотность жидкости, V — объем выталкиваемой жидкости, g — ускорение свободного падения."}
        ]
      },
      "1.3.6 Условия плавания тел": {
        "описание": "Тело в жидкости или газе будет плавать, если сила Архимеда, действующая на тело, равна или больше его веса.",
        "формулы": [
          {"формула": "ρ_тела * V_тела * g = ρ_жидкости * V_жидкости * g", "описание": "Условие плавания, где ρ — плотность вещества (тела или жидкости), V — объем тела или выталкиваемой жидкости."}
        ]
      }
    },
    "Закон сохранения в механике": {
      "1.4.1 Импульс тела": {
        "описание": "Импульс тела — это векторная величина, равная произведению массы тела на его скорость.",
        "формулы": [
          {"формула": "p = m * v", "описание": "Импульс тела, где p — импульс, m — масса тела, v — скорость."}
        ]
      },
      "1.4.2 Импульс системы тел": {
        "описание": "Импульс системы тел равен векторной сумме импульсов всех тел в системе.",
        "формулы": [
          {"формула": "P = Σp_i", "описание": "Импульс системы тел, где P — суммарный импульс системы, p_i — импульс каждого тела."}
        ]
      },
      "1.4.3 Закон сохранения импульса": {
        "описание": "Суммарный импульс замкнутой системы тел остается постоянным, если на нее не действуют внешние силы.",
        "формулы": [
          {"формула": "Σp_до = Σp_после", "описание": "Закон сохранения импульса."}
        ]
      },
      "1.4.4 Работа силы": {
        "описание": "Работа силы определяется как произведение модуля силы, перемещения и косинуса угла между ними.",
        "формулы": [
          {"формула": "A = F * s * cos(θ)", "описание": "Работа силы, где A — работа, F — сила, s — перемещение, θ — угол между F и s."}
        ]
      },
      "1.4.5 Мощность": {
        "описание": "Мощность — это величина, характеризующая скорость выполнения работы.",
        "формулы": [
          {"формула": "P = A / t", "описание": "Средняя мощность, где P — мощность, A — работа, t — время."},
          {"формула": "P = F * v * cos(θ)", "описание": "Мгновенная мощность при действии силы."}
        ]
      },
      "1.4.6 Работа как мера изменения энергии": {
        "описание": "Работа является мерой изменения механической энергии тела или системы.",
        "формулы": [
          {"формула": "A = ΔE", "описание": "Работа равна изменению энергии системы."}
        ]
      },
      "1.4.7 Кинетическая энергия": {
        "описание": "Кинетическая энергия тела определяется его массой и скоростью.",
        "формулы": [
          {"формула": "E_k = 1/2 * m * v^2", "описание": "Кинетическая энергия, где E_k — кинетическая энергия, m — масса, v — скорость."}
        ]
      },
      "1.4.8 Потенциальная энергия": {
        "описание": "Потенциальная энергия определяется положением тела в поле силы.",
        "формулы": [
          {"формула": "E_p = m * g * h", "описание": "Потенциальная энергия в поле тяжести, где E_p — потенциальная энергия, m — масса, g — ускорение свободного падения, h — высота."},
          {"формула": "E_p = k * x^2 / 2", "описание": "Потенциальная энергия упругой деформации, где k — коэффициент упругости, x — деформация."}
        ]
      },
      "1.4.9 Закон сохранения механической энергии": {
        "описание": "Полная механическая энергия замкнутой системы остается постоянной при отсутствии потерь на трение.",
        "формулы": [
          {"формула": "E_k1 + E_p1 = E_k2 + E_p2", "описание": "Закон сохранения механической энергии."}
        ]
      }
    },
    "Механические колебания и волны": {
      "1.5.1 Гармонические колебания": {
        "описание": "Гармоническими называются колебания, описываемые синусоидальной или косинусоидальной зависимостью.",
        "формулы": [
          {"формула": "x(t) = A * cos(ωt + φ)", "описание": "Уравнение гармонических колебаний, где A — амплитуда, ω — угловая частота, φ — фаза."}
        ]
      },
      "1.5.2 Амплитуда и фаза колебаний": {
        "описание": "Амплитуда — максимальное отклонение от равновесия. Фаза характеризует состояние системы в начальный момент времени.",
        "формулы": []
      },
      "1.5.3 Период колебаний": {
        "описание": "Период — время, за которое совершается одно полное колебание.",
        "формулы": [
          {"формула": "T = 1 / f", "описание": "Период колебаний, где T — период, f — частота."}
        ]
      },
      "1.5.4 Частота колебаний": {
        "описание": "Частота — число колебаний за единицу времени.",
        "формулы": [
          {"формула": "f = 1 / T", "описание": "Частота колебаний."}
        ]
      },
      "1.5.5 Свободные колебания (математический и пружинный маятники)": {
        "описание": "Свободные колебания происходят под действием внутренних сил системы.",
        "формулы": [
          {"формула": "T = 2π * sqrt(l / g)", "описание": "Период математического маятника, где l — длина нити, g — ускорение свободного падения."},
          {"формула": "T = 2π * sqrt(m / k)", "описание": "Период пружинного маятника, где m — масса, k — коэффициент упругости."}
        ]
      },
      "1.5.6 Вынужденные колебания": {
        "описание": "Вынужденные колебания возникают под действием внешней периодической силы.",
        "формулы": []
      },
      "1.5.7 Резонанс": {
        "описание": "Резонанс возникает, когда частота внешнего воздействия совпадает с собственной частотой системы.",
        "формулы": []
      },
      "1.5.8 Длина волны": {
        "описание": "Длина волны — это расстояние, на которое распространяется волна за один период.",
        "формулы": [
          {"формула": "λ = v / f", "описание": "Длина волны, где λ — длина волны, v — скорость волны, f — частота."}
        ]
      },
      "1.5.9 Звук": {
        "описание": "Звук — это механическая волна, распространяющаяся в упругой среде.",
        "формулы": []
      }
    }
  },
  "Молекулярная физика. Термодинамика": {
    "Молекулярная физика": {
      "2.1.1 Модели строения газов, жидкостей и твердых тел": {
        "описание": "Молекулярные модели описывают структуру вещества как совокупность частиц, взаимодействующих друг с другом.",
        "формулы": []
      },
      "2.1.2 Тепловое движение атомов и молекул вещества": {
        "описание": "Атомы и молекулы вещества находятся в постоянном хаотическом движении, интенсивность которого зависит от температуры.",
        "формулы": []
      },
      "2.1.3 Броуновское движение": {
        "описание": "Броуновское движение — это беспорядочное движение частиц в жидкости или газе под действием молекул среды.",
        "формулы": []
      },
      "2.1.4 Диффузия": {
        "описание": "Диффузия — процесс взаимного проникновения частиц одного вещества между частицами другого.",
        "формулы": []
      },
      "2.1.5 Экспериментальные доказательства атомистической теории. Взаимодействие частиц вещества": {
        "описание": "Эксперименты подтверждают существование атомов и молекул как структурных единиц вещества.",
        "формулы": []
      },
      "2.1.6 Модель идеального газа": {
        "описание": "Модель идеального газа предполагает, что взаимодействие молекул происходит только при их столкновениях.",
        "формулы": []
      },
      "2.1.7 Связь между давлением и средней кинетической энергией теплового движения молекул идеального газа": {
        "описание": "Давление газа связано со средней кинетической энергией молекул.",
        "формулы": [
          {"формула": "p = 2/3 * (N/V) * ⟨E_k⟩", "описание": "Связь давления и кинетической энергии молекул."}
        ]
      },
      "2.1.8 Абсолютная температура": {
        "описание": "Абсолютная температура пропорциональна средней кинетической энергии частиц.",
        "формулы": [
          {"формула": "T = ⟨E_k⟩ / k", "описание": "Абсолютная температура, где k — постоянная Больцмана."}
        ]
      },
      "2.1.9 Связь температуры газа со средней кинетической энергией его частиц": {
        "описание": "Температура газа определяет интенсивность движения молекул.",
        "формулы": []
      },
      "2.1.10 Уравнение состояния идеального газа": {
        "описание": "Уравнение состояния идеального газа связывает давление, объем и температуру.",
        "формулы": [
          {"формула": "pV = nRT", "описание": "Уравнение Менделеева-Клапейрона, где p — давление, V — объем, n — количество вещества, R — универсальная газовая постоянная, T — температура."}
        ]
      },
      "2.1.11 Изопроцессы: изотермический, изохорный, изобарный, адиабатный процессы": {
        "описание": "Изопроцессы характеризуются постоянством одного из параметров состояния (температуры, давления, объема).",
        "формулы": [
          {"формула": "pV = const (T = const)", "описание": "Изотермический процесс."},
          {"формула": "p/T = const (V = const)", "описание": "Изохорный процесс."},
          {"формула": "V/T = const (p = const)", "описание": "Изобарный процесс."},
          {"формула": "pV^γ = const", "описание": "Адиабатный процесс, где γ — показатель адиабаты."}
        ]
      },
      "2.1.12 Насыщенные и ненасыщенные пары": {
        "описание": "Насыщенный пар находится в динамическом равновесии с жидкостью, а ненасыщенный пар может продолжать конденсироваться.",
        "формулы": []
      },
      "2.1.13 Влажность воздуха": {
        "описание": "Влажность воздуха характеризует содержание водяного пара в воздухе.",
        "формулы": [
          {"формула": "φ = (p_пар / p_нас) * 100%", "описание": "Относительная влажность, где φ — влажность, p_пар — парциальное давление пара, p_нас — давление насыщенного пара."}
        ]
      },
      "2.1.14 Изменение агрегатных состояний вещества: испарение и конденсация, кипение жидкости": {
        "описание": "Переход вещества между различными агрегатными состояниями сопровождается поглощением или выделением энергии.",
        "формулы": []
      },
      "2.1.15 Изменение агрегатных состояний вещества: плавление и кристаллизация": {
        "описание": "Процессы плавления и кристаллизации происходят при определенных температурах, зависящих от природы вещества.",
        "формулы": []
      },
      "2.1.16 Изменение энергии в фазовых переходах": {
        "описание": "При фазовых переходах энергия затрачивается на изменение внутренней энергии вещества.",
        "формулы": [
          {"формула": "Q = λ * m", "описание": "Количество теплоты при плавлении или испарении, где λ — скрытая теплота, m — масса."}
        ]
      },
      "2.1.17 Внутренняя энергия": {
        "описание": "Внутренняя энергия тела включает в себя как кинетическую, так и потенциальную энергию молекул вещества.",
        "формулы": [
          {"формула": "U = U_кинет + U_пот", "описание": "Внутренняя энергия вещества."}
        ]
      },
      "2.1.18 Закон Дальтона о частичных давлениях": {
        "описание": "Закон Дальтона гласит, что давление смеси газов равно сумме давлений, которые каждый газ оказывает в одиночку при одинаковой температуре и объеме.",
        "формулы": [
          {"формула": "p_смеси = p_1 + p_2 + ... + p_n", "описание": "Закон Дальтона."}
        ]
      },
      "2.1.19 Закон Авогадро": {
        "описание": "Закон Авогадро утверждает, что объем одного моля газа при постоянной температуре и давлении одинаков для всех газов.",
        "формулы": [
          {"формула": "V_m = V / n", "описание": "Объем одного моля газа, где V — объем, n — количество вещества."}
        ]
      },
      "2.2 Термодинамика": {
        "2.2.1 Основные положения термодинамики": {
          "описание": "Термодинамика изучает преобразования энергии и работу различных систем.",
          "формулы": []
        },
        "2.2.2 Первая глава термодинамики": {
          "описание": "Первая глава термодинамики рассматривает закон сохранения энергии и его применение в термодинамических процессах.",
          "формулы": [
            {"формула": "ΔU = Q - A", "описание": "Первый закон термодинамики, где ΔU — изменение внутренней энергии, Q — теплота, A — работа."}
          ]
        },
        "2.2.3 Теплоемкость": {
          "описание": "Теплоемкость — это величина, показывающая, сколько теплоты необходимо для изменения температуры тела на 1 градус.",
          "формулы": [
            {"формула": "C = ΔQ / ΔT", "описание": "Теплоемкость, где C — теплоемкость, ΔQ — количество теплоты, ΔT — изменение температуры."}
          ]
        },
        "2.2.4 Изобарный процесс": {
          "описание": "Изобарный процесс — это процесс, при котором давление остается постоянным.",
          "формулы": [
            {"формула": "pV = const", "описание": "Изобарный процесс."}
          ]
        },
        "2.2.5 Изохорный процесс": {
          "описание": "Изохорный процесс — это процесс, при котором объем остается постоянным.",
          "формулы": [
            {"формула": "p / T = const", "описание": "Изохорный процесс."}
          ]
        },
        "2.2.6 Изотермический процесс": {
          "описание": "Изотермический процесс — это процесс, при котором температура остается постоянной.",
          "формулы": [
            {"формула": "pV = const", "описание": "Изотермический процесс."}
          ]
        },
        "2.2.7 Адиабатный процесс": {
          "описание": "Адиабатный процесс — это процесс, при котором не происходит теплообмена с окружающей средой.",
          "формулы": [
            {"формула": "pV^γ = const", "описание": "Адиабатный процесс, где γ — показатель адиабаты."}
          ]
        },
        "2.2.8 Второй закон термодинамики": {
          "описание": "Второй закон термодинамики утверждает, что теплота не может самопроизвольно переходить от более холодного тела к более горячему.",
          "формулы": []
        },
        "2.2.9 Энтропия": {
          "описание": "Энтропия — это мера беспорядка или хаоса в системе.",
          "формулы": [
            {"формула": "dS = dQ / T", "описание": "Изменение энтропии, где dS — изменение энтропии, dQ — количество теплоты, T — температура."}
          ]
        },
        "2.2.10 Теплоемкость при постоянном давлении": {
          "описание": "Теплоемкость при постоянном давлении показывает, сколько теплоты необходимо для изменения температуры вещества на 1 градус при постоянном давлении.",
          "формулы": [
            {"формула": "C_p = ΔQ / ΔT", "описание": "Теплоемкость при постоянном давлении."}
          ]
        },
        "2.2.11 Теплоемкость при постоянном объеме": {
          "описание": "Теплоемкость при постоянном объеме показывает, сколько теплоты необходимо для изменения температуры вещества на 1 градус при постоянном объеме.",
          "формулы": [
            {"формула": "C_v = ΔQ / ΔT", "описание": "Теплоемкость при постоянном объеме."}
          ]
        }
      }
    }
  },
  "Электричество и магнетизм": {
    "3.1 Электрическое поле": {
      "3.1.1 Электрическое поле. Заряд": {
        "описание": "Электрическое поле — это область пространства, в которой на заряды действуют силы.",
        "формулы": [
          {"формула": "F = k * q1 * q2 / r^2", "описание": "Закон Кулона, где F — сила взаимодействия, k — константа, q1 и q2 — заряды, r — расстояние между ними."}
        ]
      },
      "3.1.2 Потенциал и напряженность электрического поля": {
        "описание": "Потенциал и напряженность электрического поля связаны между собой.",
        "формулы": [
          {"формула": "E = F / q", "описание": "Напряженность поля, где E — напряженность, F — сила, q — заряд."},
          {"формула": "V = k * q / r", "описание": "Потенциал поля, где V — потенциал, k — константа, q — заряд, r — расстояние."}
        ]
      },
      "3.1.3 Электрический ток. Закон Ома": {
        "описание": "Электрический ток — это движение заряженных частиц. Закон Ома описывает зависимость тока от сопротивления и напряжения.",
        "формулы": [
          {"формула": "I = V / R", "описание": "Закон Ома, где I — ток, V — напряжение, R — сопротивление."}
        ]
      },
      "3.1.4 Энергия электрического тока": {
        "описание": "Энергия, расходуемая электрическим током, зависит от напряжения, тока и времени.",
        "формулы": [
          {"формула": "E = V * I * t", "описание": "Энергия электрического тока, где E — энергия, V — напряжение, I — ток, t — время."}
        ]
      },
      "3.1.5 Работа электрического тока": {
        "описание": "Работа электрического тока зависит от напряжения, тока и перемещения заряда.",
        "формулы": [
          {"формула": "A = Q * U", "описание": "Работа тока, где A — работа, Q — заряд, U — напряжение."}
        ]
      },
      "3.1.6 Электрическое сопротивление. Закон Джоуля-Ленца": {
        "описание": "Электрическое сопротивление определяет, насколько сильно проводник препятствует прохождению тока. Закон Джоуля-Ленца описывает выделение тепла в проводнике.",
        "формулы": [
          {"формула": "R = ρ * l / A", "описание": "Сопротивление проводника, где R — сопротивление, ρ — удельное сопротивление, l — длина, A — площадь поперечного сечения."},
          {"формула": "Q = I^2 * R * t", "описание": "Количество теплоты, выделяемой в проводнике, где Q — теплота, I — ток, R — сопротивление, t — время."}
        ]
      },
      "3.1.7 Электрическое поле и его источники": {
        "описание": "Электрическое поле создается зарядом или распределением зарядов. Его свойства зависят от типа зарядов и их расположения.",
        "формулы": []
      },
      "3.1.8 Электрическое поле в проводниках": {
        "описание": "Электрическое поле внутри проводников является нулевым в состоянии равновесия.",
        "формулы": []
      }
    },
    "3.2 Законы постоянного тока": {
      "3.2.1 Постоянный электрический ток. Сила тока": {
        "описание": "Сила тока — это количество заряда, проходящего через поперечное сечение проводника за единицу времени.",
        "формулы": [
          {"формула": "I = Q / t", "описание": "Сила тока, где I — сила тока, Q — заряд, t — время."}
        ]
      },
      "3.2.2 Напряжение в электрической цепи": {
        "описание": "Напряжение — это работа, которую совершает электрическое поле при перемещении единичного заряда по цепи.",
        "формулы": [
          {"формула": "U = A / Q", "описание": "Напряжение, где U — напряжение, A — работа, Q — заряд."}
        ]
      },
      "3.2.3 Закон Ома для участка цепи": {
        "описание": "Закон Ома для участка цепи связывает ток, напряжение и сопротивление.",
        "формулы": [
          {"формула": "I = U / R", "описание": "Закон Ома для участка цепи, где I — ток, U — напряжение, R — сопротивление."}
        ]
      },
      "3.2.4 Электрическое сопротивление": {
        "описание": "Сопротивление проводника зависит от материала, длины и площади поперечного сечения.",
        "формулы": [
          {"формула": "R = ρ * l / A", "описание": "Сопротивление проводника, где R — сопротивление, ρ — удельное сопротивление, l — длина, A — площадь поперечного сечения."}
        ]
      },
      "3.2.5 Электродвижущая сила и внутренняя энергия источника тока": {
        "описание": "Электродвижущая сила (ЭДС) источника тока определяет работу, совершаемую источником при перемещении заряда.",
        "формулы": [
          {"формула": "E = W / Q", "описание": "Электродвижущая сила, где E — ЭДС, W — работа, Q — заряд."}
        ]
      },
      "3.2.6 Закон Ома для полной электрической цепи": {
        "описание": "Закон Ома для полной цепи связывает ЭДС, сопротивление цепи и ток.",
        "формулы": [
          {"формула": "I = E / (R + r)", "описание": "Закон Ома для полной цепи, где I — ток, E — ЭДС, R — сопротивление цепи, r — внутреннее сопротивление источника."}
        ]
      }
    },
    "3.3 Магнитное поле": {
      "3.3.1 Взаимодействие магнитов": {
        "описание": "Магниты взаимодействуют друг с другом, причем противоположные полюса притягиваются, а одинаковые отталкиваются.",
        "формулы": []
      },
      "3.3.2 Магнитное поле проводника с током": {
        "описание": "Проводник с током создает магнитное поле, которое можно описать с помощью закона Био-Савара и Ампера.",
        "формулы": [
          {"формула": "B = μ₀ * I / (2 * π * r)", "описание": "Магнитное поле, создаваемое проводником с током, где B — магнитная индукция, μ₀ — магнитная проницаемость, I — ток, r — расстояние от проводника."}
        ]
      },
      "3.3.3 Сила Ампера": {
        "описание": "Сила Ампера действует на проводник с током в магнитном поле.",
        "формулы": [
          {"формула": "F = B * I * L * sin(θ)", "описание": "Сила Ампера, где F — сила, B — магнитная индукция, I — ток, L — длина проводника, θ — угол между проводником и магнитным полем."}
        ]
      },
      "3.3.4 Сила Лоренца": {
        "описание": "Сила Лоренца действует на заряд в магнитном и электрическом полях.",
        "формулы": [
          {"формула": "F = q * (E + v × B)", "описание": "Сила Лоренца, где F — сила, q — заряд, E — электрическое поле, v — скорость заряда, B — магнитное поле."}
        ]
      }
    },
    "3.4 Электромагнитная индукция": {
      "3.4.1 Явление электромагнитной индукции": {
        "описание": "Электромагнитная индукция — это процесс возникновения электрического тока в замкнутой цепи при изменении магнитного поля.",
        "формулы": []
      },
      "3.4.2 Магнитный поток": {
        "описание": "Магнитный поток — это количество магнитных линий, проходящих через площадь, перпендикулярную к направлению магнитного поля.",
        "формулы": [
          {"формула": "Φ = B * S * cos(θ)", "описание": "Магнитный поток, где Φ — магнитный поток, B — магнитная индукция, S — площадь, θ — угол между направлением магнитного поля и нормалью к поверхности."}
        ]
      },
      "3.4.3 Закон электромагнитной индукции Фарадея": {
        "описание": "Закон Фарадея утверждает, что индукционное напряжение пропорционально скорости изменения магнитного потока.",
        "формулы": [
          {"формула": "ε = -dΦ / dt", "описание": "Индукционное напряжение, где ε — ЭДС индукции, dΦ — изменение магнитного потока, dt — изменение времени."}
        ]
      },
      "3.4.4 Правило Ленца": {
        "описание": "Правило Ленца описывает направление индукционного тока, который всегда направлен так, чтобы противодействовать изменению магнитного потока.",
        "формулы": []
      },
      "3.4.5 Самоиндукция": {
        "описание": "Самоиндукция — это явление возникновения ЭДС в проводнике, если в нем изменяется ток.",
        "формулы": [
          {"формула": "ε = -L * (dI / dt)", "описание": "Самоиндукция, где ε — ЭДС индукции, L — индуктивность, dI — изменение тока, dt — изменение времени."}
        ]
      },
      "3.4.6 Индуктивность": {
        "описание": "Индуктивность — это величина, характеризующая способность проводника или катушки создавать магнитное поле при прохождении тока.",
        "формулы": [
          {"формула": "L = N * Φ / I", "описание": "Индуктивность, где L — индуктивность, N — число витков, Φ — магнитный поток, I — ток."}
        ]
      },
      "3.4.7 Энергия магнитного поля": {
        "описание": "Энергия магнитного поля хранится в магнитном поле проводника с током.",
        "формулы": [
          {"формула": "E = (1/2) * L * I^2", "описание": "Энергия магнитного поля, где E — энергия, L — индуктивность, I — ток."}
        ]
      }
    },
    "3.5 Электромагнитные колебания и волны": {
      "3.5.1 Электрические и магнитные колебания": {
        "описание": "Электрические и магнитные колебания происходят в контуре, содержащем индуктивность и емкость.",
        "формулы": []
      },
      "3.5.2 Электромагнитные волны": {
        "описание": "Электромагнитные волны распространяются в пространстве, сочетая переменные электрическое и магнитное поля.",
        "формулы": []
      },
      "3.5.3 Скорость электромагнитной волны": {
        "описание": "Скорость электромагнитной волны в вакууме равна скорости света, которая является константой.",
        "формулы": [
          {"формула": "c = 3 * 10^8 м/с", "описание": "Скорость света в вакууме."}
        ]
      },
      "3.5.4 Электромагнитные волны в средах": {
        "описание": "Электромагнитные волны распространяются в различных средах с изменением скорости и длины волны.",
        "формулы": [
          {"формула": "v = c / n", "описание": "Скорость электромагнитной волны в среде, где v — скорость волны в среде, c — скорость света в вакууме, n — показатель преломления среды."}
        ]
      },
      "3.5.5 Принцип сверхпроводимости": {
        "описание": "Сверхпроводимость — это явление, при котором материалы теряют сопротивление при определенных условиях, например, при очень низких температурах.",
        "формулы": []
      }
    },
    "3.6 Оптика": {
      "3.6.1 Природа света": {
        "описание": "Свет — это электромагнитное излучение, которое может проявляться как волна или частица (фотон).",
        "формулы": []
      },
      "3.6.2 Отражение и преломление света": {
        "описание": "Отражение — это изменение направления света, когда он сталкивается с поверхностью. Преломление — это изменение направления при переходе света между различными средами.",
        "формулы": [
          {"формула": "n₁ * sin(θ₁) = n₂ * sin(θ₂)", "описание": "Закон преломления (Закон Снелла), где n₁, n₂ — показатели преломления сред, θ₁, θ₂ — углы падения и преломления."}
        ]
      },
      "3.6.3 Интерференция света": {
        "описание": "Интерференция — это явление, при котором два или более световых волн, взаимодействуя, усиливают или ослабляют друг друга.",
        "формулы": [
          {"формула": "Δx = m * λ / d", "описание": "Условие для интерференции двух волн, где Δx — расстояние между максимумами, m — порядок интерференции, λ — длина волны, d — расстояние между щелями."}
        ]
      },
      "3.6.4 Дифракция света": {
        "описание": "Дифракция — это отклонение света от прямолинейного пути при его встрече с препятствием.",
        "формулы": [
          {"формула": "a * sin(θ) = m * λ", "описание": "Условие дифракции, где a — ширина щели, θ — угол отклонения, m — порядок дифракции, λ — длина волны."}
        ]
      },
      "3.6.5 Поляризация света": {
        "описание": "Поляризация света — это процесс, при котором волны света ограничиваются в определенном направлении.",
        "формулы": []
      },
      "3.6.6 Закон поглощения света": {
        "описание": "Закон поглощения описывает, как интенсивность света уменьшается при его прохождении через поглощающее вещество.",
        "формулы": [
          {"формула": "I = I₀ * e^(-α * x)", "описание": "Закон поглощения, где I — интенсивность света на расстоянии x, I₀ — начальная интенсивность, α — коэффициент поглощения."}
        ]
      },
      "3.6.7 Оптические приборы": {
        "описание": "Оптические приборы используют свойства света для получения изображений, их усиления или изменения направления.",
        "формулы": []
      }
    },
    "4. Молекулярная физика": {
      "4.1 Кинетическая теория вещества": {
        "4.1.1 Основные положения кинетической теории": {
          "описание": "Кинетическая теория вещества объясняет макроскопические свойства вещества через движение молекул. Она основывается на представлении о молекулах как частицах, движущихся с различной скоростью.",
          "формулы": []
        },
        "4.1.2 Давление идеального газа": {
          "описание": "Давление газа можно описать через среднюю кинетическую энергию молекул, которая зависит от температуры.",
          "формулы": [
            {"формула": "P = (1/3) * (N / V) * m * v²", "описание": "Уравнение состояния идеального газа, где P — давление, N — число молекул, V — объем, m — масса молекулы, v — средняя скорость молекул."}
          ]
        },
        "4.1.3 Температура и внутренняя энергия газа": {
          "описание": "Температура газа связана с средней кинетической энергией молекул, а внутренняя энергия — с суммой этих энергий для всех молекул газа.",
          "формулы": [
            {"формула": "U = (3/2) * n * R * T", "описание": "Внутренняя энергия идеального газа, где U — внутренняя энергия, n — число молей, R — универсальная газовая постоянная, T — температура."}
          ]
        },
        "4.1.4 Уравнение состояния идеального газа": {
          "описание": "Уравнение состояния связывает давление, объем и температуру газа для идеального газа.",
          "формулы": [
            {"формула": "PV = nRT", "описание": "Уравнение состояния идеального газа, где P — давление, V — объем, n — число молей, R — универсальная газовая постоянная, T — температура."}
          ]
        }
      },
      "4.2 Термодинамика": {
        "4.2.1 Основные положения термодинамики": {
          "описание": "Термодинамика изучает процессы передачи и преобразования энергии, включая теплоту, работу и их взаимодействие.",
          "формулы": []
        },
        "4.2.2 Первый закон термодинамики": {
          "описание": "Первый закон термодинамики выражает принцип сохранения энергии: изменение внутренней энергии системы равно сумме подведенной теплоты и работы, совершенной системой.",
          "формулы": [
            {"формула": "ΔU = Q - A", "описание": "Первый закон термодинамики, где ΔU — изменение внутренней энергии, Q — подведенная теплота, A — работа."}
          ]
        },
        "4.2.3 Второй закон термодинамики": {
          "описание": "Второй закон термодинамики гласит, что энтропия замкнутой системы либо остается постоянной, либо увеличивается.",
          "формулы": []
        },
        "4.2.4 Теплоемкость и удельная теплоемкость": {
          "описание": "Теплоемкость системы — это количество теплоты, необходимое для повышения температуры системы на единицу.",
          "формулы": [
            {"формула": "C = Q / ΔT", "описание": "Теплоемкость, где C — теплоемкость, Q — подведенная теплота, ΔT — изменение температуры."}
          ]
        }
      },
      "4.3 Теплопередача": {
        "4.3.1 Способы теплопередачи": {
          "описание": "Теплопередача может происходить тремя способами: теплопроводностью, конвекцией и излучением.",
          "формулы": []
        },
        "4.3.2 Закон теплопроводности Фурье": {
          "описание": "Закон теплопроводности Фурье описывает процесс передачи тепла в веществе через его границы.",
          "формулы": [
            {"формула": "Q = -k * A * (dT / dx)", "описание": "Закон Фурье для теплопроводности, где Q — количество передаваемого тепла, k — коэффициент теплопроводности, A — площадь поперечного сечения, dT/dx — градиент температуры."}
          ]
        },
        "4.3.3 Конвекция": {
          "описание": "Конвекция — это процесс переноса тепла за счет движения жидкости или газа, где более горячие участки поднимаются, а холодные опускаются.",
          "формулы": []
        },
        "4.3.4 Излучение": {
          "описание": "Излучение — это процесс передачи тепла через электромагнитные волны, не требующий среды для распространения.",
          "формулы": [
            {"формула": "E = σ * A * (T^4 - T₀^4)", "описание": "Закон Стефана-Больцмана для излучения, где E — мощность излучения, σ — постоянная Стефана-Больцмана, A — площадь поверхности, T — температура поверхности, T₀ — температура окружающей среды."}
          ]
        }
      }
    },
    "Квантовая физика": {
      "5.1 Корпускулярно-волновой дуализм": {
        "5.1.1 Гипотеза М. Планка о квантах": {
          "описание": "Планк предложил гипотезу о том, что энергия может передаваться только дискретно, в виде квантов, с минимальным возможным значением.",
          "формулы": [
            {"формула": "E = h * f", "описание": "Зависимость энергии фотона от его частоты, где E — энергия, h — постоянная Планка, f — частота."}
          ]
        },
        "5.1.2 Фотоэффект": {
          "описание": "Фотоэффект — это явление, при котором световые волны, воздействуя на металл, выбивают из него электроны.",
          "формулы": [
            {"формула": "E_k = h * f - W", "описание": "Уравнение для кинетической энергии выбитого электрона, где E_k — кинетическая энергия, h — постоянная Планка, f — частота света, W — работа выхода."}
          ]
        },
        "5.1.3 Опыты А.Г. Столетова": {
          "описание": "А.Г. Столетов проводил эксперименты, подтверждающие квантовую природу фотоэффекта и связь работы выхода с металлом.",
          "формулы": []
        },
        "5.1.4 Уравнение Эйнштейна для фотоэффекта": {
          "описание": "Эйнштейн обобщил гипотезу Планка и объяснил фотоэффект как результат взаимодействия фотонов с электронами.",
          "формулы": [
            {"формула": "E_k = h * f - W", "описание": "Уравнение Эйнштейна для фотоэффекта, где E_k — кинетическая энергия выбитого электрона, h — постоянная Планка, f — частота света, W — работа выхода."}
          ]
        },
        "5.1.5 Фотоны": {
          "описание": "Фотон — это элементарная частица света, которая не имеет массы и переносит квант энергии.",
          "формулы": []
        },
        "5.1.6 Энергия фотона": {
          "описание": "Энергия фотона пропорциональна его частоте и инверсионно пропорциональна длине волны.",
          "формулы": [
            {"формула": "E = h * f", "описание": "Энергия фотона, где E — энергия фотона, h — постоянная Планка, f — частота света."}
          ]
        },
        "5.1.7 Импульс фотона": {
          "описание": "Импульс фотона связан с его энергией и скоростью света.",
          "формулы": [
            {"формула": "p = E / c", "описание": "Импульс фотона, где p — импульс, E — энергия фотона, c — скорость света."}
          ]
        },
        "5.1.8 Гипотеза де Бройля о волновых свойствах частиц": {
          "описание": "Де Бройль предложил гипотезу о том, что все частицы, включая электроны, обладают волновыми свойствами.",
          "формулы": [
            {"формула": "λ = h / p", "описание": "Связь длины волны с импульсом частицы, где λ — длина волны, h — постоянная Планка, p — импульс."}
          ]
        },
        "5.1.9 Дифракция электронов": {
          "описание": "Дифракция электронов — это явление, при котором электроны проявляют волновые свойства, проходя через препятствия.",
          "формулы": []
        }
      },
      "5.2 Физика атома": {
        "5.2.1 Планетарная модель атома": {
          "описание": "Планетарная модель атома описывает атом как систему, где электроны движутся вокруг ядра по орбитам, подчиняясь законам электростатики.",
          "формулы": []
        },
        "5.2.2 Постулаты Бора": {
          "описание": "Бор предложил постулаты, объясняющие спектры атомов и энергетические уровни электронов.",
          "формулы": [
            {"формула": "E_n = - (k * e^2) / (2 * r_n)", "описание": "Энергия электрона на n-ом уровне, где E_n — энергия, k — коэффициент, e — заряд электрона, r_n — радиус орбиты."}
          ]
        },
        "5.2.3 Линейчатые спектры": {
          "описание": "Линейчатые спектры излучения и поглощения связаны с переходами электронов между дискретными энергетическими уровнями.",
          "формулы": []
        },
        "5.2.4 Лазер": {
          "описание": "Лазер — это источник света, который излучает монохроматический свет с высокой когерентностью и направленностью.",
          "формулы": []
        }
      },
      "5.3 Физика атомного ядра": {
        "5.3.1 Радиоактивность": {
          "описание": "Радиоактивность — это процесс самопроизвольного распада нестабильных ядер, сопровождающийся излучением частиц.",
          "формулы": []
        },
        "5.3.2 Закон радиоактивного распада": {
          "описание": "Закон радиоактивного распада описывает процесс исчезновения радиоактивных ядер с течением времени.",
          "формулы": [
            {"формула": "N(t) = N₀ * e^(-λ * t)", "описание": "Закон распада, где N(t) — количество ядер в момент времени t, N₀ — начальное количество, λ — константа распада, t — время."}
          ]
        },
        "5.3.3 Нуклонная модель ядра": {
          "описание": "Нуклонная модель ядра описывает ядро как систему, состоящую из протонов и нейтронов, взаимодействующих друг с другом.",
          "формулы": []
        },
        "5.3.4 Энергия связи нуклонов в ядре": {
          "описание": "Энергия связи нуклонов в ядре определяется как разница между массой отдельных нуклонов и массой ядра.",
          "формулы": []
        },
        "5.3.5 Ядерные реакции": {
          "описание": "Ядерные реакции включают процессы деления, синтеза и взаимодействия ядер, которые сопровождаются значительным высвобождением энергии.",
          "формулы": []
        }
      }
    }
  }}
